# N1.
num1 = 1523
num2 = 30

print(num1 + num2)
print(num1 - num2)
print(num1 * num2)
print(num1 / num2)

# შევქმენი ორი ცვლადი, და შემდგომში პრინტის საშუალებით გავაკეთე მათემატიკური მოქმედებები


# N2
name = "გიორგი"
age = 16

print("ჩემი სახელია " + name + "და ვარ " + str(age) + " წლის")
#შევქმენი ორი ცვლადი, ჩემი სახელი და ასაკის მნიშვნელობით, და დავბეჭდე წინადადება. ვინაიდან ასაკი ინტეჯერია, ის სთრინგად გადავაკეთე რათა წინადადებაში შეცდომა არ ყოფილიყო

# N3.

points = 35
points = 23
points = 51

print(points)

# point-ის მნიშვნელობა სამჯერ განახლდა, რის გამოც ბეჭდვის დროს ყველაზე ბოლო მნიშვნელობა დაიწერება, ანუ 51.

# N4.

birthday_year = 2008
current_year = 2024
print("my age is" + str(birthday_year-current_year))

# შევქმენი ორი ცვლადი, პირველი ჩემი დაბადების წელი, შემდგომში კი ახლანდელი წელი, ხოლო პრინტის მეშვეობით გავიგე, თუ რამდენი წელია გასული ჩემი დაბადებიდან დღემდე, ანუ ჩემი ასაკი.