name = "გიორგი"
last_name = "ტლაშაძე"
age = 16
height = 1.70
favorite_color = "იასამნისფერი"
school = "ხიდისთავის საჯარო სკოლა"
favorite_drink = "ცივი ჩაი"
favorite_food = "კატლეტი"
future_job = "პროგრამისტი"
hobby = "ცეკვა"

# შევქმენი ათი ცვლადი, თავდაპირველად დავწერე მისი დასახელება, შემდგომში მისი დეკლარაცია, და საბოლოოდ დასახელება

print("მე მქვია" + " " + name + ", " + "ჩემი გვარია" + " " + last_name + ", " + "მე ვარ" + " " + str(age) + " " + "წლის, " + " " + "მე ვსწავლობ" + " " + school + "ში, " + "სიმაღლეში ვარ" + " " + str(height) + ", " + "ჩემი საყვარელი სასმელია" + " " + favorite_drink + ", " + "საჭმელებიდან ყველაზე მეტად მიყვარს" + " " + favorite_food + ", " + "ჩემი საყვარელი ფერია" + " " + favorite_color + ", " + "ჩემი ჰობია" + " " + hobby + ", " + "მომავალში კი მინდა გავხდე" + " " + future_job + ".")

# დავპრინტე წინადადება, სადაც გამოვიყენე ყველა ზემოთ მოცემული ცვლადი. ვინაიდანაც age და height არ წარმოადგენს text data-ს, დაპრინტვის დროს მათ str-ქომანდი დავუწერე, რათა ტერმინალს სწორად გამოეტანა ტექსტი.

სახელი = "გიორგი"
გვარი = "ტლაშაძე"
ასაკი = 16
ქვეყანა = "საქართველო"

print(სახელი)
print(გვარი)
print(ასაკი)
print(ქვეყანა)

# შევქმენი ოთხი ცვლადი, შემოდგომში კი დავპრინტე.

num1 = 5000
num2 = 2845

print(num1 + 345)
print(num1 - 534)
print(num1 * 5)
print(num1 / 7)
print(num1 // 3)
print(num1 ** 3)
print(num2 + 1263)
print(num2 - 220)
print(num2 / 3)
print(num2 * 72)

# შევქმენი ორი ცვლადი, შემდგომში კი მათი მეშვეობით გავაკეთე 10 მაგალითი მათემატიკური ოპერატორების გამოყენებით.

people_in_UK = 66460000
people_in_US = 326700000

print(people_in_US - people_in_UK)

# შევქმენი ორი ცვლადი, რომლებსაც მივანიჭე რიცხვითი დასახელებები და მათი მეშვეობით დავბეჭდე არითმეტიკული მოქმედება.